"""
Задание 3
Необходимо написать программу, которая будет запрашивать
у пользователя месяц и дату рождения и выводить соответствующий знак зодиака.
"""

day = int(input("Введите день рождения: "))
month = int(input("Введите месяц рождения (1–12): "))

dictionary = [
    (1, 20, "Водолей"),
    (2, 19, "Рыбы"),
    (3, 21, "Овен"),
    (4, 20, "Телец"),
    (5, 21, "Близнецы"),
    (6, 21, "Рак"),
    (7, 23, "Лев"),
    (8, 23, "Дева"),
    (9, 23, "Весы"),
    (10, 23, "Скорпион"),
    (11, 22, "Стрелец"),
    (12, 22, "Козерог"),
    (12, 32, "Водолей")  # фиктивная дата для завершения
]

if 1 <= month <= 12 and 1 <= day <= 31:
    for i in range(len(dictionary)):
        curr_month, curr_day, sign = dictionary[i]
        if (month < curr_month) or (month == curr_month and day < curr_day):
            print("Знак зодиака:", dictionary[i - 1][2])
            break
else:
    print("Некорректная дата")